In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())
from pandasql import sqldf

In [2]:
sqladb=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',names=['Age','workclass','fnlwgt','education','education-num','marital-status','occupation','relationship','race','sex','capital-gain','capital-loss','hours-per-week','native-country','>50K, <=50K'])

def trimAllColumns(df):
  trimStrings = lambda x:x.strip() if type(x) is str else x
  return df.applymap(trimStrings)

sqladb = trimAllColumns(sqladb)

sqladb.columns = sqladb.columns.str.replace('-','_')

In [6]:
# Create a sqlalchemy engine using sample from the data set
from sqlalchemy import create_engine

db_uri = "sqlite:///db.sqlite"
engine = create_engine(db_uri)

#result = engine.execute('drop table "TPOP9" ');
sqladb.to_sql('TPOP9',con=engine)
result = engine.execute('SELECT * FROM '
                        '"TPOP9" limit 10')
for _r in result:
   print(_r)

(0, 39, 'State-gov', 77516, 'Bachelors', 13, 'Never-married', 'Adm-clerical', 'Not-in-family', 'White', 'Male', 2174, 0, 40, 'United-States', '<=50K')
(1, 50, 'Self-emp-not-inc', 83311, 'Bachelors', 13, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'White', 'Male', 0, 0, 13, 'United-States', '<=50K')
(2, 38, 'Private', 215646, 'HS-grad', 9, 'Divorced', 'Handlers-cleaners', 'Not-in-family', 'White', 'Male', 0, 0, 40, 'United-States', '<=50K')
(3, 53, 'Private', 234721, '11th', 7, 'Married-civ-spouse', 'Handlers-cleaners', 'Husband', 'Black', 'Male', 0, 0, 40, 'United-States', '<=50K')
(4, 28, 'Private', 338409, 'Bachelors', 13, 'Married-civ-spouse', 'Prof-specialty', 'Wife', 'Black', 'Female', 0, 0, 40, 'Cuba', '<=50K')
(5, 37, 'Private', 284582, 'Masters', 14, 'Married-civ-spouse', 'Exec-managerial', 'Wife', 'White', 'Female', 0, 0, 40, 'United-States', '<=50K')
(6, 49, 'Private', 160187, '9th', 5, 'Married-spouse-absent', 'Other-service', 'Not-in-family', 'Black', 'Female', 0, 0, 16, 'Jamaica', '<=50K')
(7, 52, 'Self-emp-not-inc', 209642, 'HS-grad', 9, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'White', 'Male', 0, 0, 45, 'United-States', '>50K')
(8, 31, 'Private', 45781, 'Masters', 14, 'Never-married', 'Prof-specialty', 'Not-in-family', 'White', 'Female', 14084, 0, 50, 'United-States', '>50K')
(9, 42, 'Private', 159449, 'Bachelors', 13, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'White', 'Male', 5178, 0, 40, 'United-States', '>50K')

In [7]:
# Write 2 basic update queries
result =engine.execute('update "TPOP9" set workclass="Private" where fnlwgt==77516')
result =engine.execute('update "TPOP9" set sex="Female" where fnlwgt==234721')
result = engine.execute('SELECT * FROM '
                        '"TPOP9"  where fnlwgt IN (77516,234721)')
for _r in result:
   print(_r)

(0, 39, 'Private', 77516, 'Bachelors', 13, 'Never-married', 'Adm-clerical', 'Not-in-family', 'White', 'Male', 2174, 0, 40, 'United-States', '<=50K')
(3, 53, 'Private', 234721, '11th', 7, 'Married-civ-spouse', 'Handlers-cleaners', 'Husband', 'Black', 'Female', 0, 0, 40, 'United-States', '<=50K')

In [8]:
# Write 2 delete queries
result =engine.execute('DELETE FROM "TPOP9" where fnlwgt==45781')
result =engine.execute('DELETE FROM "TPOP9" where fnlwgt==159449')
result = engine.execute('SELECT * FROM '
                        '"TPOP9"  where fnlwgt IN (45781,159449)')
for _r in result:
   print(_r)

In [9]:
# Write 2 filter queries
result = engine.execute('SELECT * FROM '
                        '"TPOP9"  where fnlwgt == 160187')
result = engine.execute('SELECT * FROM '
                        '"TPOP9"  where fnlwgt == 83311')
for _r in result:
   print(_r)

(1, 50, 'Self-emp-not-inc', 83311, 'Bachelors', 13, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'White', 'Male', 0, 0, 13, 'United-States', '<=50K')
(16474, 54, 'Self-emp-not-inc', 83311, 'Prof-school', 15, 'Married-civ-spouse', 'Prof-specialty', 'Husband', 'White', 'Male', 0, 0, 30, 'United-States', '>50K')

In [10]:
# Write 2 function queries
result = engine.execute('SELECT count(*) FROM '
                        '"TPOP9"  where sex == "Male" ')
for _r in result:
   print('Number of male count is',_r)
    
result = engine.execute('SELECT sum(capital_gain) FROM '
                        '"TPOP9"  ')
for _r in result:
   print('Capital gain is',_r)

Number of male count is (21786,)
Capital gain is (35070062,)